app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "cities"
---
  def index
    @cities = City.paginate(:page => params[:page], :per_page => 5)